#+TITLE: Carbs Linux User Manual
#+AUTHOR: Cem Keylan
#+TEXINFO_FILENAME: carbslinux.info
#+TEXINFO_DIR_CATEGORY: System Administration
#+TEXINFO_DIR_TITLE: Carbs Linux: (carbslinux)
#+TEXINFO_DIR_DESC: Carbs Linux User Manual
#+OPTIONS: html-postamble:nil html-scripts:nil

#+BEGIN_COMMENT
This is the documentation source for Carbs Linux in Org-mode. The macros below
are used for assigning IDs to contribution guidelines.
#+END_COMMENT
#+MACRO: contid [@@texinfo:@anchor{$1}@@$1]
#+MACRO: sectid (eval (format "%s [%s]\n@@texinfo:@anchor{%s}@@\n" $2 $1 $1))

This is the full documentation of [[https://carbslinux.org][Carbs Linux]], from the details of the
distribution, installation, to the package manager. It is not yet complete.

#+BEGIN_EXPORT ascii
You can build and install the 'info' package in order to view this documentation
with the info reader. It is divided into sections and easier to read.
#+END_EXPORT

#+BEGIN_EXPORT texinfo
@ifplaintext
You can build and install the @command{info} package in order to view this
documentation with the info reader. It is divided into sections and easier to
read.
@end ifplaintext

@ifhtml
This documentation is also available in the distribution by the
@command{carbs-docs} package, which can be read by either running
@code{info carbslinux} or reading @file{/usr/share/doc/carbslinux/carbslinux.txt}
with your favorite pager. You can install either the @command{info} or
@command{texinfo} for doing the first.
@end ifhtml
#+END_EXPORT

*** Signature verification
:PROPERTIES:
:DESCRIPTION: Verify the signature of the rootfs tarball
:END:

It is highly recommended to verify the signature of the tarball. You will need
the OpenBSD tool =signify(1)= for this. Many distributions provide a package for
it, if you are using a Carbs Linux host, you can also install the package
=otools= which provides =signify=. Download the signature first.

#+BEGIN_SRC sh
wget $URL/carbs-rootfs.tar.xz.sig
#+END_SRC

The signature file should say something similar to

#+begin_src sh :exports results :results verbatim
curl -L https://dl.carbslinux.org/releases/x86_64/carbs-rootfs.tar.xz.sig
#+end_src

#+RESULTS:
: untrusted comment: verify with carbslinux-2023.02.pub
: RWTe38zmx+iyuKEL5T84MJ5Y24jqenkTtQLJxbaMzOBS/NkGVl5J+Vn2B6vTV/gJK7LYBPS+IOXV5sEf+YLGCMcBYAGHCcP4xQ8=

Grab the key (which probably should be the latest one) that is written on the
file from [[https://dl.carbslinux.org/keys/]] so you can verify the signature. The
latest Signify public key is also available on the [[https://git.carbslinux.org/repository][package repository]], so you can
check the validity of the public key from multiple locations, or just copy paste
that portion to a file and use that instead.

#+begin_src sh :noweb yes
<<pubkey>>
wget https://dl.carbslinux.org/keys/$PUBKEY
#+end_src

You can now verify the distribution tarball with signify.

#+begin_src sh
signify -V -m carbs-rootfs.tar.xz -p $PUBKEY
#+end_src

If everything went alright, this should output:

#+begin_example
Signature Verified
#+end_example

